package com.zzk.link;

/**
 * 短信模板类，变更类型以+为替换符
 *
 * @author John
 * @Description:
 * @date： 2018年3月8日 下午3:25:35
 */
public class Template {
    /**
     * 注册验证码
     */
    public static String REGISTER_CODE = "注册验证码：您的短信验证码是+,+分钟内有效，如非本人操作请忽略该信息【达西云商】";
    /**
     * 修改密码验证码
     */
    public static String UPDATE_PWD_CODE = "修改密码验证码：您的短信验证码是+,+分钟内有效，如非本人操作请忽略该信息【达西云商】";
    /**
     * 找回密码验证码
     */
    public static String FIND_PWD_CODE = "验证码：+，+分钟内有效。您正在申请手机号码找回密码，若非本人操作请忽略【达西云商】";
    /**
     * 动态密码验证码
     */
    public static String DYNAMIC_PWD_CODE = "动态密码：+，+分钟内有效。您正在申请使用手机号码动态密码登录，若非本人操作请忽略【达西云商】";
    /**
     * 消息提醒
     */
    public static String MESSAGE_CODE = "您有+条新的+消息,请登录达西云商+进行处理,+【达西云商】";


    /*******************************************商家端信息********************************/
    /**
     * 新订单
     */
    public static String NEW_ORDER = "您有一个新的订单，请及时登录达西供应商平台进行订单确认。【达西云商】";

    /**
     * 已取消
     */
    public static String CANCEL_ORDER = "有客人取消了订单，可登录达西供应商平台-订单列表中查看。【达西云商】";

    /**
     * 退款申请
     */
    public static String REFUND_ORDER = "您有一条退款申请，请及时登录达西供应商平台进行处理。【达西云商】";

    /**
     * 差评
     */
    public static String BAD_EVALUATE = "您有一条差评，请及时登录达西供应商平台进行处理。【达西云商】";
    /**
     * 财务
     */
    public static String FINANCE_MESSAGE = "您有一条新的财务通知，请及时登录达西供应商平台进行处理。【达西云商】";

    /**
     * 满团提醒
     */
    public static String FULL_GROUP = "您有一个产品已经预定满团，可登录达西供应商平台-发团管理进行处理。【达西云商】";


    /****************************************用户端信息********************************/
    /**
     * 线路预定
     */
    public static String CREATE_ORDER ="等待确认:您的订单已提交成功，请等待商家确认。预计会在+前以短信通知您结果。【达西云商】";
    /**
    * 线路确认
    */
    public static String CONFIRM_ORDER = "商家已确认，您的出行套餐预订成功：订单号+，出发日期：+,+出发，行程共+天。目的地气候情况多变，请提前做好出行准备。导游电话+。若行程有变动请联系我们18602822925。【达西云商】";
    
    /**
     * 商家拒单
     */
    public static String REFUSE_ORDER = "订单取消:+先生/女士，很抱歉地通知您，您所预定的+，+出发，+天行程出行套餐，因产品行程改变已为您取消，所支付的费用将在2小时内自动返回至您支付的账户。同时，我们为您推荐了相似的出行计划，点击+重新预订【达西云商】";
    /**
     * 订单超时系统拒单
     */
    public static String SYSTEM_REFUSE_ORDER = "+先生/女士，您的订单因长时间未支付，系统已自动为您取消，点击 + 重新预订。咨询电话18602822925。【达西云商】";
    /**
     * 退款申请
     */
    public static String REFUND_APPLY = "订单已取消：您预订的+，+出发，+天行程的出行套餐，订单号:+，已成功取消，我们将根据产品退款协议，返还我们将返还总计+元的费用。若无异议，24小时后自动返还，若有疑问请联系我们18602822925。【达西云商】";

    /**
     * 酒店预定
     */
    public static String CREATE_ORDER_HOTEL ="等待确认：您的订单已通知酒店，请等待酒店确认。预计会在+前以短信通知您结果。【达西云商】";
    /**
     * 酒店确认
     */
    public static String CONFIRM_ORDER_HOTEL = "酒店已确认，您的房间预订成功：订单号+；入住日期：+；+，总计+间+晚，总价+元。酒店地址：+，酒店电话：+。若行程有变动请联系我们18602822925。【达西云商】";
    /**
     * 酒店预订（立即确认）
     */
    public static String CREATE_CONFIRM_ORDER_HOTEL = "您的房间预订成功：订单号+；入住日期：+；+，总计+间+晚，总价+元。酒店地址：+，酒店电话：+。若行程有变动请联系我们18602822925。【达西云商】";
    /**
     * 酒店拒单
     */
    public static String REFUSE_ORDER_HOTEL = "订单取消：+先生/女士，很抱歉地通知您，+因满房已取消您的房间预订，所支付的房费将在2小时内自动返回至您支付的账户。为避免耽误您的行程，我们为您推荐了临近的+，点击+重新预订。【达西云商】";
    /**
     * 系统拒单酒店
     */
    public static String REFUSE_ORDER_HOTEL_SYSTEM = "订单取消：+先生/女士，很抱歉地通知您，+因长时间未对订单进行确认，已为您取消了该酒店的房间预订，所支付的房费将在2小时内自动返回至您支付的账户。为避免耽误您的行程，我们为您推荐了临近的+，点击+重新预订。【达西云商】";
    
    /**
     * 酒店退款申请
     */
    public static String REFUND_APPLY_HOTEL = "订单已取消：您预订的+入住的+，订单号+，已成功取消，所支付的房费将在2小时内自动返回至您支付的账户。【达西云商】";

    /**
     * 运营信息
     */
    public static String AGENT_ORDER="订单提醒:您有一个订单等待确认,订单号:+,商家:+,订单金额:+元。【达西云商】";
    public static String AGENT_REFUND_ORDER="退款提醒:您有一个订单已退款,订单号为:+,退款金额为:+元。【达西云商】";
    public static String AGENT_REFUND_FAILD="退款提醒:您有一个退款申请退款失败订单号为+。【达西云商】";

}
